In [7]:
import pandas as pd
from sqlalchemy import create_engine

# Database connection string
engine = create_engine('postgresql://uvg_user:uvg_password@db:5432/health_data')

# Simple query to test the foundation layer
try:
    df = pd.read_sql("SELECT 1 as connection_status", engine)
    print("Connection Successful! Your Biomedical Data Stack is ready.")
    print(df)
except Exception as e:
    print(f"Connection Failed: {e}")

Connection Successful! Your Biomedical Data Stack is ready.
   connection_status
0                  1

In [8]:
df = pd.read_sql("""
SELECT patient_id, sex, birth_date, created_at
FROM patient
ORDER BY patient_id;
""", engine)

df

   patient_id sex  birth_date                 created_at
0           1   F  1990-05-12 2026-01-16 00:43:24.195075
1           2   M  1984-11-03 2026-01-16 00:43:24.195075
2           3   O  2001-07-21 2026-01-16 00:43:24.195075
3           4   F  1975-02-18 2026-01-16 00:43:24.195075
4           5   M  1998-09-30 2026-01-16 00:43:24.195075
5           6   F  1990-05-12 2026-01-17 00:21:26.005901
6           7   M  1984-11-03 2026-01-17 00:21:26.005901
7           8   O  2001-07-21 2026-01-17 00:21:26.005901
8           9   F  1975-02-18 2026-01-17 00:21:26.005901
9          10   M  1998-09-30 2026-01-17 00:21:26.005901

In [9]:
pd.read_sql("SELECT sex, COUNT(*) n FROM patient GROUP BY sex ORDER BY n DESC;", engine)

  sex  n
0   M  4
1   F  4
2   O  2

In [10]:
pd.read_sql("SELECT COUNT(*) AS has_chronic_condition FROM patient WHERE has_chronic_condition = true", engine)

   has_chronic_condition
0                      4

In [11]:
pd.read_sql("SELECT city, COUNT(*) n FROM patient GROUP BY city ORDER BY n DESC", engine)

             city  n
0       Guatemala  4
1         Antigua  2
2       Escuintla  2
3  Quetzaltenango  2